posts/2019-01-06-theology-on-tap.org
#+title: Theology on Tap
#+date: <2019-01-06>
#+filetags: books

Theology on Tap OK is a monthly reading group led by Mitch Randall and Randy Ridenour. Each month, we will read and discuss a theological work. The group meets at 6:30 p.m. on some evening when most can attend at Louie's Grill and Bar, 3750 W Robinson St., Norman, OK 73072

** Upcoming Book

Our next book is [[https://www.amazon.com/Searching-Sunday-Loving-Leaving-Finding-ebook/dp/B00PWOH2CI/ref=sr_1_1?crid=20XO0RS1PW7EZ&keywords=searching+for+sunday+rachel+held+evans&qid=1559954172&s=gateway&sprefix=sear%2Caps%2C157&sr=8-1][_Searching for Sunday_]] by Rachel Held Evans. From the cover:

#+begin_quote
From New York Times bestselling author Rachel Held Evans comes a book that is both a heartfelt ode to the past and hopeful gaze into the future of what it means to be a part of the Church.
#+end_quote

Our next meeting is June 13, at 6:30 p.m.

** Previous Books

*** 2019

- February: [[https://www.amazon.com/Christ-Culture-Torchbooks-Richard-Niebuhr/dp/0061300039/ref=sr_1_1?ie=UTF8&qid=1549042217&sr=8-1&keywords=christ+and+culture][/Christ and Culture/]] by Richard Niebuhr.
- March: [[https://www.amazon.com/Jesus-Disinherited-Howard-Thurman-ebook/dp/B005K98IU0/ref=sr_1_1?ie=UTF8&qid=1549041378&sr=8-1&keywords=jesus+disinherited][/Jesus and the Disinherited/]] by Howard Thurman.
- April: [[https://www.amazon.com/Shameless-Sexual-Reformation-Nadia-Bolz-Weber-ebook/dp/B07CWG1719/ref=sr_1_1?keywords=nadia+bolz&qid=1559953715&s=gateway&sr=8-1][/Shameless: A Sexual Reformation/]] by Nadio Bolz-Weber.
- May: [[https://www.amazon.com/Economy-Grace-Kathryn-Tanner-ebook/dp/B000SBJM50/ref=sr_1_1?crid=3RWVZCXW1SPF6&keywords=economy+of+grace+kathryn+tanner&qid=1559953844&s=gateway&sprefix=economy+of+grace%2Caps%2C158&sr=8-1][/Economy of Grace/]] by Kathryn Tanner.
- June: [[https://www.amazon.com/Searching-Sunday-Loving-Leaving-Finding-ebook/dp/B00PWOH2CI/ref=sr_1_1?crid=20XO0RS1PW7EZ&keywords=searching+for+sunday+rachel+held+evans&qid=1559954172&s=gateway&sprefix=sear%2Caps%2C157&sr=8-1][/Searching for Sunday/]] by Rachel Held Evans.


#+begin_tagline
Tagged: [[file:../tags/religion.org][Religion]]
#+end_tagline
