docs/posts/2019-01-06-theology-on-tap.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Mar 29, 2025 13:16 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Theology on Tap</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link href='/pagefind/pagefind-ui.css' rel='stylesheet'>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Theology on Tap</h1>
<p class="subtitle" role="doc-subtitle">Jan 06, 2019 00:00</p>
</header><p>
Theology on Tap OK is a monthly reading group led by Mitch Randall and Randy Ridenour. Each month, we will read and discuss a theological work. The group meets at 6:30 p.m. on some evening when most can attend at Louie&rsquo;s Grill and Bar, 3750 W Robinson St., Norman, OK 73072
</p>
<section id="outline-container-orgc57cdab" class="outline-2">
<h2 id="orgc57cdab">Upcoming Book</h2>
<div class="outline-text-2" id="text-orgc57cdab">
<p>
Our next book is <a href="https://www.amazon.com/Searching-Sunday-Loving-Leaving-Finding-ebook/dp/B00PWOH2CI/ref=sr_1_1?crid=20XO0RS1PW7EZ&amp;keywords=searching+for+sunday+rachel+held+evans&amp;qid=1559954172&amp;s=gateway&amp;sprefix=sear%2Caps%2C157&amp;sr=8-1"><span class="underline">Searching for Sunday</span></a> by Rachel Held Evans. From the cover:
</p>

<blockquote>
<p>
From New York Times bestselling author Rachel Held Evans comes a book that is both a heartfelt ode to the past and hopeful gaze into the future of what it means to be a part of the Church.
</p>
</blockquote>

<p>
Our next meeting is June 13, at 6:30 p.m.
</p>
</div>
</section>
<section id="outline-container-org422e95b" class="outline-2">
<h2 id="org422e95b">Previous Books</h2>
<div class="outline-text-2" id="text-org422e95b">
</div>
<div id="outline-container-org01d7833" class="outline-3">
<h3 id="org01d7833">2019</h3>
<div class="outline-text-3" id="text-org01d7833">
<ul class="org-ul">
<li>February: <a href="https://www.amazon.com/Christ-Culture-Torchbooks-Richard-Niebuhr/dp/0061300039/ref=sr_1_1?ie=UTF8&amp;qid=1549042217&amp;sr=8-1&amp;keywords=christ+and+culture"><i>Christ and Culture</i></a> by Richard Niebuhr.</li>
<li>March: <a href="https://www.amazon.com/Jesus-Disinherited-Howard-Thurman-ebook/dp/B005K98IU0/ref=sr_1_1?ie=UTF8&amp;qid=1549041378&amp;sr=8-1&amp;keywords=jesus+disinherited"><i>Jesus and the Disinherited</i></a> by Howard Thurman.</li>
<li>April: <a href="https://www.amazon.com/Shameless-Sexual-Reformation-Nadia-Bolz-Weber-ebook/dp/B07CWG1719/ref=sr_1_1?keywords=nadia+bolz&amp;qid=1559953715&amp;s=gateway&amp;sr=8-1"><i>Shameless: A Sexual Reformation</i></a> by Nadio Bolz-Weber.</li>
<li>May: <a href="https://www.amazon.com/Economy-Grace-Kathryn-Tanner-ebook/dp/B000SBJM50/ref=sr_1_1?crid=3RWVZCXW1SPF6&amp;keywords=economy+of+grace+kathryn+tanner&amp;qid=1559953844&amp;s=gateway&amp;sprefix=economy+of+grace%2Caps%2C158&amp;sr=8-1"><i>Economy of Grace</i></a> by Kathryn Tanner.</li>
<li>June: <a href="https://www.amazon.com/Searching-Sunday-Loving-Leaving-Finding-ebook/dp/B00PWOH2CI/ref=sr_1_1?crid=20XO0RS1PW7EZ&amp;keywords=searching+for+sunday+rachel+held+evans&amp;qid=1559954172&amp;s=gateway&amp;sprefix=sear%2Caps%2C157&amp;sr=8-1"><i>Searching for Sunday</i></a> by Rachel Held Evans.</li>
</ul>


<div class="tagline" id="orgdf745b9">
<p>
Tagged: <a href="../tags/religion.html">Religion</a>
</p>

</div>
</div>
</div>
</section>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Mar 29, 2025 13:16.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
